[
  {"reviewer_name":"Jay Nistad","rating":5,"comment":"I want to take a moment to recognize and sincerely thank Darrin Paul for everything he has done for my son, Peter Nistad. Peter is a high-level 16-year-old tennis player, and Darrin has been an incredibly important part of his development, not just physically, but mentally as well. His knowledge, attention to detail, and commitment to doing things the right way have made a real difference in Peter's performance on court. What I appreciate most is that Darrin truly cares. He doesn't take shortcuts, he focuses on long-term progress, and he puts injury prevention at the center of everything he does. As a parent, it's a great feeling knowing Peter is training with someone who prioritizes his health, his future, and his confidence as an athlete. We've seen noticeable improvements in Peter's movement, strength, and overall durability, and that has translated directly into better performance and more consistency on the court. Darrin has been supportive, motivating, and steady through every step of the process. We are genuinely grateful for the time, effort, and heart Darrin brings to his work. I would recommend him without hesitation to any athlete or parent looking for a trainer who truly makes a difference.","review_date":"2026-02-19"},
  {"reviewer_name":"Tina Pisnik","rating":5,"comment":"I've been working with Darren for the past two years, and the consistency and results speak for themselves. His online training program is extremely well structured, easy to follow, and perfectly tailored to my needs as a professional athlete. The workouts are delivered clearly through his platform, which makes it seamless to train from my home gym or anywhere I am at the moment, while still feeling fully coached and accountable. Darren understands performance, injury prevention, and long-term athletic development at a very high level. Beyond that, he brings great energy to everything he does, he's knowledgeable, motivating, and yes, funny and charming! But most importantly, he gets results and truly cares about the athletes he works with. I couldn't recommend him more.","review_date":"2026-02-15"},
  {"reviewer_name":"Ganna","rating":5,"comment":"I'm a professional tennis player and I'm so glad to have crossed paths with coach Darren! Very grateful and lucky for the opportunity to work together. He's truly the best coach I've ever worked with. He builds not only my athletic performance, but my personality as well. Extremely knowledgeable, supportive and genuinely invested in your growth. The best!","review_date":"2026-02-12"},
  {"reviewer_name":"Abigail Rencheli","rating":5,"comment":"As someone who's been in sports most of her life and worked with countless coaches, I can confidently say Darren is truly one of the best. He's extremely passionate about what he does and his knowledge and expertise is evident in how personalized and detail-oriented his program is. What really sets him apart is how much he genuinely cares about you as a person first. He takes the time to understand individual goals, limitations, and strengths, and makes you feel supported every step of the way. Darren creates a very enjoyable environment that makes you look forward to every session, even when you sometimes don't feel like working out.","review_date":"2026-02-10"},
  {"reviewer_name":"Mary Starr","rating":5,"comment":"Yortago Athlete Health and Performance was exactly what we needed for our 15 year old Autistic son Joshua. Josh had grown very fast, was under muscled, had low energy, core weakness and struggled with his gate. Every session we see more and more improvement in his stamina, muscle gains, gate and cognitive improvements. We are also seeing improvements in concentration and reading. Because he has social anxiety the one on one sessions are perfect and he loves coming to see Coach Darrin. Darrin has a great way with Josh that is encouraging but pushes him. We are very happy with Yortago!","review_date":"2025-12-11"},
  {"reviewer_name":"Laura Capuana","rating":5,"comment":"Darren Paul is an excellent personal trainer! After many physical therapy sessions without results, Darren quickly identified the cause of my shoulder pain and created a targeted exercise plan to strengthen my muscles and improve mobility. He is not only highly knowledgeable and attentive, but also an excellent personal trainer who truly cares about his clients. Thanks to his dedication, I have significantly reduced pain and increased strength. Highly recommended!","review_date":"2025-08-11"},
  {"reviewer_name":"Luciana Hall","rating":5,"comment":"My competitive soccer player son suffered from a torn labrum hip that kept him in pain for several months and off the field. After finding Darren through referral, his expert knowledge and very specific rehab program provided immediate results and my son is now pain free and well on his way to getting back on the field. All of this was possible in just a few weeks with Darren. We are extremely pleased and grateful for Darren and we highly recommend him.","review_date":"2025-07-04"},
  {"reviewer_name":"Staci Warden","rating":5,"comment":"Darren is the most brilliant trainer out there. I have never met anyone with such deep knowledge of human physiology and how your body works and the way to get maximum power and agility. He has a very coherent world view on strength and health and how to be a better athlete. He thinks you can do things, even when you don't think you can do them, he's not into babying any part of your body (even if it's not currently working properly), he cares a lot about form, he has high expectations, and he's constantly making you do exercises you've never heard of before. His favorite word is explosive, so, if you want to get stronger and more explosive, call him; if you want to just dial it in, it's probably not going to be a fun experience for you. :)","review_date":"2025-06-07"},
  {"reviewer_name":"shaden shorrosh","rating":5,"comment":"Exceptional training and care! My daughter a tennis player was dealing with a hip flexor injury that was impacting her performance and causing her to miss vital training. Coach Darren provided a strengthening training and treatment plan that addressed her needs and helped strengthen the muscles to prevent future issues. Coach Darren is a professional who is highly educated and brings years of experience to the table. Within few sessions, my daughter was back on the court, stronger and more confident than ever. If you're looking for a trainer who genuinely cares and delivers results, look no more.. thank you Coach Darren!","review_date":"2025-01-09"},
  {"reviewer_name":"Lindsey Montague","rating":5,"comment":"We were referred to Darren by our sports physician as part of the recovery process along with PT. Darren has been very impactful in just the short amount of time my son has been working with him. He doesn't only just target the injured muscle but works on targeting all the muscles specifically for improving his performance for his sports position. My son finds him to be very knowledgeable and trusts that his experience will benefit for him the long term when he's away at college. Frankly, I wish we had found Darren before the injury happened because with more training, perhaps it could've been avoided.","review_date":"2025-01-08"},
  {"reviewer_name":"Caden Flanagan","rating":5,"comment":"I think your training is helping me start to feel muscles I didn't know were there. I have also noticed it's helping me be more explosive on the field. You're also a super positive person that lifts my spirit and a good roll model.","review_date":"2025-01-02"},
  {"reviewer_name":"Tyler Gundelfinger","rating":5,"comment":"I am a baseball player in college, and do a program from here. I can honestly say the program here is 10x what you will get from any sports program. This is all about getting direct on field results!","review_date":"2024-12-25"},
  {"reviewer_name":"Ana O'Donell","rating":5,"comment":"I cannot recommend Coach Darren highly enough! After struggling with reoccurring injuries, I turned to him for help, and it has made all the difference. As a health and performance trainer, he has tailored an approach that not only aids in my recovery but also focuses on strengthening my body to perform at its best while preventing future injuries on the court. I feel stronger, healthier, and more capable than ever. I truly appreciate the personalized attention and expertise he brings to his training. He is undoubtedly the best in the field of athlete health and performance. Thank you Coach Darren!","review_date":"2024-10-23"},
  {"reviewer_name":"Nikesh Reddy","rating":5,"comment":"I have been working with coach Darren for over a year now and I would HIGHLY recommend him. He really helped me build up strength, flexibility, agility, speed, recovering/preventing injuries and I could see drastic improvement of my performance on court. He also uses top notch equipment which enhances every workout and gets the most out of it!","review_date":"2024-09-19"},
  {"reviewer_name":"Sergio Palumbo","rating":5,"comment":"Working with Coach Darren has been a game-changer! Their personalized approach, attention to detail, and motivational style have helped me reach goals I never thought possible. Each session is well-planned and challenging, but also fun and engaging. Whether you're a beginner or more advanced, Darren tailors everything to your needs. Highly recommend to anyone looking to take their fitness to the next level!","review_date":"2024-09-19"},
  {"reviewer_name":"Prime Expos","rating":5,"comment":null,"review_date":"2024-09-17"},
  {"reviewer_name":"Alison Patterson","rating":5,"comment":"My athlete loves working with Darren and has had the best results of his career since starting small group training. He is knowledgeable and motivating but keeps it fun for his students. He is very approachable and quick to answer questions and share feedback.","review_date":"2024-09-16"},
  {"reviewer_name":"Heather Pierre","rating":5,"comment":"Coach Darren is a great trainer and has been exceptional over the last year in helping our daughter reach her goals. His expertise, positive attitude, and personalized approach have made each training session both effective and enjoyable for our daughter. We highly recommend Coach Darren!","review_date":"2024-09-16"},
  {"reviewer_name":"Anne Marie Lago","rating":5,"comment":"My husband has had severe back pain, so he went to see Darren and worked with Jay on some exercises to strengthen his lower back, hips and legs. Jay walked out of there with immediate relief. Thank you Darren.","review_date":"2024-07-23"},
  {"reviewer_name":"Vanessa Galindo","rating":5,"comment":"Darren is currently training my son who plays competitive soccer, and the significance since he began the personal training has been significant. His response to the ball, along with speed and agility have greatly improved. Highly recommend Darren.","review_date":"2024-06-25"},
  {"reviewer_name":"Gina Kondos","rating":5,"comment":"I recently began training with Darren and have loved it since day 1. I was always hesitant about online programming, but the way Darren is able to communicate and personalize the programs is amazing. His platform is extremely unique and innovative that with the training also comes specific videos to help as I work through programs on my own. Darren is also great with recovery and as I battled through my injuries, we were able to proactively remain active yet controlled. I feel as I walk away from each session not only stronger but also smarter and more knowledgeable.","review_date":"2024-06-23"},
  {"reviewer_name":"Adam Rowe","rating":5,"comment":"Darren has been the very best in 20years that i have ever seen and i think his credentials with the people and professional athletes that he has helped speak on why everyone goes to him. Amazing person great at what he does i cant say how much he has helped me with any injuries i have had. So if your looking for the best its here thanks Darren!","review_date":"2024-04-24"},
  {"reviewer_name":"Angie G","rating":5,"comment":"Darren is an excellent trainer, coach and mentor. He pays exceptional attention to detail and tailors a workout especially to address your specific fitness goals. I highly recommend Darren and Yortago for any fitness journey that you considering for yourself.","review_date":"2024-04-10"},
  {"reviewer_name":"Trish Goodwin","rating":5,"comment":"I had an outstanding experience with Darren! He was incredibly attentive and very knowledgeable. The quality of training he provides is top notch!","review_date":"2024-04-06"},
  {"reviewer_name":"Brandon Hockenbury","rating":5,"comment":"I met Darren through work. When I heard he was a fitness trainer I jumped at the chance to have him help me with my gains. He quickly accepted and began teaching me everything from basics, to advanced workouts. Explaining how and why we would do certain exercises. He's truly acceptable at what he does!","review_date":"2024-03-24"},
  {"reviewer_name":"Sydney Robbins","rating":5,"comment":"Darren is an excellent trainer! I would highly recommend his services to anyone. No matter where you are on your fitness journey he can meet you there and help you improve to provide a personalized experience.","review_date":"2024-03-23"},
  {"reviewer_name":"Natalie Carroll","rating":5,"comment":"I cannot say enough great things about Coach Darren. In just a short amount of time, we have seen incredible results with my son. He is patient, knowledgeable, and truly dedicated to helping my son improve!! Highly recommended!","review_date":"2024-03-15"},
  {"reviewer_name":"Mark Monelli","rating":5,"comment":"Darren is a highly skilled, professional, fun to work with trainer. He runs great classes and can help with injury issues via one on one sessions.","review_date":"2024-03-14"},
  {"reviewer_name":"Robin Meek","rating":5,"comment":"Dr. Darren is fun, knowledgeable and applies all exercises to your personal life!","review_date":"2024-03-07"},
  {"reviewer_name":"Darlar Clowater Reed","rating":5,"comment":"His (Darren) attention to detail and willingness to adjust the exercises to fit my needs was very much appreciated. His enthusiasm and positive attitude had also made the experience enjoyable. I appreciate you taking time to answer all my questions. Thank you so much and I am looking forward to more training sessions in the future. You will not be disappointed if you use him as a trainer. He is very knowledgeable and makes it lots of fun. Thank you","review_date":"2024-03-07"},
  {"reviewer_name":"Terri","rating":5,"comment":"Darren is an exceptional trainer! He is very knowledgeable and not only knows what exercises/stretches/movements I need, but can tell me exactly why and how it will impact my performance. It's so helpful to understand the why. He's also a very calm, pleasant human and obviously enjoys his sessions. I will definitely continue to seek his help with my strength and flexibility improvement.","review_date":"2024-03-06"},
  {"reviewer_name":"bizzebevr","rating":5,"comment":"Darren is a wonderful and knowledgeable trainer! He explains the reasoning behind each exercise and how to properly do them. My energy and strength is improving and I always look forward to my next session!","review_date":"2024-03-06"},
  {"reviewer_name":"Ulrike Dorfner","rating":5,"comment":"Coach Darren is an absolute gem! His wealth of knowledge is evident in every session, Sienna and Sophia absolutely adore working with him. His professionalism shines through in every aspect of his coaching, and we truly appreciate how he approaches each athlete as a whole, tailoring programs to their specific needs. From pro athletes to kids as young as six years old and adults, Coach Darren works with all levels. Not only does he provide top-notch training, but he's also always available for advice or feedback whenever we need it. We feel incredibly grateful to have him as our kids' coach. In short, Coach Darren is a true standout in the field, catering to our girls with expertise, care, and unwavering support. We're beyond thankful to have him guiding our family's journey in the sport of tennis.","review_date":"2024-02-16"},
  {"reviewer_name":"Jamie Hughes","rating":5,"comment":"After a serious knee injury, I found myself under Darren's expert care, and it was a game-changer. His approach is impressively customised, aligning perfectly with my lifestyle and specific needs. His deep knowledge was evident in every session, and his incredible accessibility allowed me to reach out at any time, helping to not only keep me on track, but enhance my recovery in real time. Darren is not just good; he's possibly the best in the field. Highly recommended for anyone seeking a recovery journey that feels tailor-made!","review_date":"2024-02-08"},
  {"reviewer_name":"Djbeck80","rating":5,"comment":"My son has seen Darren for about 5 weeks now and already seen amazing results in his speed and form. Amazing instructor great with my teenager.","review_date":"2024-02-07"},
  {"reviewer_name":"sandeep chennadi","rating":5,"comment":"Darren has been exceptional. I would say his biggest strength is adjusting the exercise on the fly to what the person is experiencing, whether it is pain or weakness. Incredibly detail oriented. Definitely knows his stuff. I know anatomy and I can tell you he knows his stuff. He is a very high yield trainer. There are many trainers who are very good, I myself have worked with 4 previously, no complaints. But Darren is extra special. He is a pros pro.","review_date":"2024-02-05"},
  {"reviewer_name":"Jennifer Swanson","rating":5,"comment":"I love how Darren takes time to show you the movements and makes sure you are doing the movements correctly. His classes are AMAZING!","review_date":"2024-02-03"},
  {"reviewer_name":"David","rating":5,"comment":"Completely transforming my daughters strength and conditioning. We are already seeing great results. Can't wait to see in six months.","review_date":"2024-02-03"},
  {"reviewer_name":"侯天昊","rating":5,"comment":"I've been training and doing online program with Darren for almost a year, his personalized fitness and rehab program have helped me achieve my fitness goals and better tennis performance. Even though I'm in other countries sometimes, our communication was smooth and he always respond quickly with clear instructions on my workout. I highly recommend Darren to anyone seeking a professional and knowledgeable coach!","review_date":"2024-02-02"},
  {"reviewer_name":"Laly T","rating":5,"comment":"I love working with Coach Darren. He has helped me get stronger so I don't have any more pain in my knees. Coach Darren is very patient and encouraging and I am always looking forward to my next fitness session. With his help I feel stronger on the tennis court.","review_date":"2024-02-01"},
  {"reviewer_name":"Belle T","rating":5,"comment":"Coach Darren is an amazing fitness coach! I've been working with him for a little over a year and he has helped me to become a lot stronger and prevent injuries. He has made fitness a more enjoyable experience compared to what it was before.","review_date":"2024-02-01"},
  {"reviewer_name":"Vinnie Raghavan","rating":5,"comment":"Darren is absolutely amazing at what he does. Totally trust my teen with his physical training with Darren and my teen is a full time tennis academy student. Highly recommend!!","review_date":"2024-02-01"},
  {"reviewer_name":"Gretta Fridman","rating":5,"comment":null,"review_date":"2024-02-01"}
]
